InformationRegisters/СопутствующиеТоварыИУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СопутствующиеТоварыИУслуги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>#12082 отключена проверка заполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеКоличество</Name>
					<Comment>#88</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОкругленияЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СопутствующийТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаСопутствующегоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СопутствующиеТоварыКлиент/Ext/Module.bsl
// Открытие формы подбора сопутствующих товаров из документа розницы
//
Процедура ОткрытьФормуПодбора(Форма) Экспорт
	
	ВыбранаКомната = Ложь;
	ВыбранаНоменклатура = Ложь;
	ЕстьРодитель = Ложь;
	ЕстьПодчиненный = Ложь;
	
	ТекущиеДанные = Форма.Элементы.ДеревоТоваров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Сообщить("Не выбрана позиция");
		Возврат;
	КонецЕсли;
	
	МассивПозиций = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Форма.Элементы.ДеревоТоваров.ВыделенныеСтроки Цикл // Обрабатываем все выделенные строки (Комнаты + Позиции)
		ТекущиеДанные = Форма.ДеревоТоваров.НайтиПоИдентификатору(ВыделеннаяСтрока);
		ПодчиненныеСтроки = ТекущиеДанные.ПолучитьЭлементы(); 
		Если ПодчиненныеСтроки.Количество() > 0 Тогда   // Это комната 
			ВыбранаКомната = Истина;
			Для каждого СтрокаТовара из ПодчиненныеСтроки Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаТовара.УИСтрокиРодителя)  Тогда  // по комнате добавляем только "базовые" номеклатуры
					ПараметрыПодбора = Новый Структура;
					ПараметрыПодбора.Вставить("Номенклатура",				СтрокаТовара.Номенклатура);
					ПараметрыПодбора.Вставить("ХарактеристикаНоменклатуры",	СтрокаТовара.ХарактеристикаНоменклатуры);
					ПараметрыПодбора.Вставить("УИСтроки",					СтрокаТовара.УИСтроки);
					ПараметрыПодбора.Вставить("УИСтрокиРодителя",			ТекущиеДанные.УИСтрокиРодителя);
					ПараметрыПодбора.Вставить("Количество",					СтрокаТовара.Количество);
					МассивПозиций.Добавить(ПараметрыПодбора);
				КонецЕсли;
			КонецЦикла;		
		Иначе
			ВыбранаНоменклатура = Истина;
			Если ТекущиеДанные.УИСтрокиРодителя = "" Тогда
				ЕстьРодитель = Истина;
			Иначе
				ЕстьПодчиненный = Истина;
			КонецЕсли;
			ПараметрыПодбора = Новый Структура;
			ПараметрыПодбора.Вставить("Номенклатура",						ТекущиеДанные.Номенклатура);
			ПараметрыПодбора.Вставить("ХарактеристикаНоменклатуры",			ТекущиеДанные.ХарактеристикаНоменклатуры);
			ПараметрыПодбора.Вставить("УИСтроки",							ТекущиеДанные.УИСтроки);
			ПараметрыПодбора.Вставить("УИСтрокиРодителя",					ТекущиеДанные.УИСтрокиРодителя);
			ПараметрыПодбора.Вставить("Количество",							ТекущиеДанные.Количество);
			//ДобавитьВЗапрещенныеДляОбработкиСтроки(ПараметрыПодбора, ЗапрещенныеДляОбработкиСтроки, Форма.ДеревоТоваров);
			МассивПозиций.Добавить(ПараметрыПодбора);
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранаКомната И ВыбранаНоменклатура Тогда
		ПоказатьПредупреждение(, "Для добавления сопутствующих товаров следует выбрать либо только комнаты, либо только позиции в комнатах", 0, "Предупреждение!");
		Возврат;
	КонецЕсли;
	
	//Если ЕстьРодитель И ЕстьПодчиненный Тогда
	//		ПоказатьПредупреждение(, "Для добавления сопутствующих товаров следует выбрать позиции или комнаты одного уровня подчинения", 0, "Предупреждение!");
	//		Возврат;		
	//КонецЕсли;
	
	Для каждого Позиция из МассивПозиций Цикл 
		СвязанныеЭлементы = Новый Соответствие();
		Если ПрисутствуетСвязанныйСТ(СвязанныеЭлементы, Позиция.УИСтроки, Форма) Тогда
			Для каждого ДругаяПозиция из МассивПозиций Цикл 
				Если СвязанныеЭлементы.Получить(ДругаяПозиция.УИстроки) = Истина Тогда
					ПоказатьПредупреждение(, "Для добавления сопутствующих товаров следует выбрать позиции не подчиненные друг другу", 0, "Предупреждение!");
					Возврат;
				КонецЕсли;	
			КонецЦикла;		
		КонецЕсли;
	КонецЦикла;	
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("МассивПозиций", МассивПозиций);	
	
	ОткрытьФорму("РегистрСведений.СопутствующиеТоварыИУслуги.Форма.ФормаПодбора", ПараметрыПодбора, Форма, Форма.УникальныйИдентификатор);
	// Обработка ответа формы на ОбработкаВыбораПодборНаКлиенте
	
КонецПроцедуры

Функция ПрисутствуетСвязанныйСТ(СвязанныеЭлементы, Ключ, Форма)
	Присутствует = Ложь;
	СтрокиДерева = Форма.ДеревоТоваров.ПолучитьЭлементы();
	Если СтрокиДерева.Количество() > 0 Тогда
		Для Каждого Строка Из СтрокиДерева  Цикл 
			ПодчиненныеСтроки = Строка.ПолучитьЭлементы();
			Для каждого СтрокаТовара из ПодчиненныеСтроки Цикл
				Если Ключ = СтрокаТовара.УИСтрокиРодителя  Тогда 
					Присутствует = Истина;
					СвязанныеЭлементы.Вставить(СтрокаТовара.УИСтроки, Истина);
					ПрисутствуетСвязанныйСТ(СвязанныеЭлементы, СтрокаТовара.УИСтроки, Форма);
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
	КонецЕсли;
	Возврат Присутствует;
КонецФункции	

Процедура НайтиСвязанныеСтрокиПоСопуствующимТоварамПоТаблице(ТаблицаТоваров, ВыбранныеСтроки, УИСтроки, МассивСвязанных) Экспорт
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		Если СтрокаТовара.УИСтрокиРодителя = УИСтроки
			И МассивСвязанных.Найти(СтрокаТовара.ПолучитьИдентификатор()) = Неопределено 
			// проверяем, что найденная строка нет среди удаляемых пользователем
			И ВыбранныеСтроки.Найти(СтрокаТовара.ПолучитьИдентификатор()) = Неопределено  
			Тогда
			МассивСвязанных.Добавить(СтрокаТовара.ПолучитьИдентификатор());
			НайтиСвязанныеСтрокиПоСопуствующимТоварамПоТаблице(ТаблицаТоваров, ВыбранныеСтроки, СтрокаТовара.УИСтроки, МассивСвязанных);
		КонецЕсли; 			
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСопутствующиеТоварыПоТаблице(ТаблицаТоваров, МассивСопутстующихТоваровНаУдаление) Экспорт
	
	Для Каждого ИдентификаторСтроки Из МассивСопутстующихТоваровНаУдаление Цикл
		СтрокаТЧ = ТаблицаТоваров.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаТЧ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТаблицаТоваров.Удалить(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

Функция ИзменитьКоличествоСопутствущихТоваровПоТаблице(ТаблицаТоваров, Номенклатура, Характеристика, Количество, УИСтроки, ИзмененныеСтроки = Неопределено) Экспорт
	
	Если ИзмененныеСтроки = Неопределено Тогда
		ИзмененныеСтроки = Новый Массив;
	КонецЕсли;
	
	МассивЗаписей = ОбщийМодульВызовСервера.ПолучитьСписокСопутствующихТоваров(Номенклатура, Характеристика, Количество);
	Для Каждого ЗаписьРегистра из МассивЗаписей Цикл
		Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
			Если СтрокаТовара.УИСтрокиРодителя = УИСтроки
				И СтрокаТовара.Номенклатура = ЗаписьРегистра.Номенклатура
				И СтрокаТовара.ХарактеристикаНоменклатуры = ЗаписьРегистра.Характеристика 
				И СтрокаТовара.ЕдиницаИзмерения = ЗаписьРегистра.ЕдиницаИзмерения
				Тогда
				СтрокаТовара.Количество = ЗаписьРегистра.Количество;
				
				ИзмененныеСтроки.Добавить(СтрокаТовара);
				ИзменитьКоличествоСопутствущихТоваровПоТаблице(ТаблицаТоваров, СтрокаТовара.Номенклатура, СтрокаТовара.ХарактеристикаНоменклатуры, СтрокаТовара.Количество, СтрокаТовара.УИСтроки, ИзмененныеСтроки);
			КонецЕсли; 			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИзмененныеСтроки;
	
КонецФункции
